backend-api/app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function login()
    {
        $model = new UserModel();

        $data = $this->request->getPost();

        if(empty($data))
        {
            $data = $this->request->getJSON(true);
        }

        $user = $model
            ->where('username',$data['username'])
            ->first();

UPDATE `users` SET `token` = '78ef3b239f918e34bb6332f56b034cc9cd2a873a8976ef39fbaea91b0eec34ef'
WHERE `users`.`id` IN ('1')
---

        $token = bin2hex(random_bytes(32));

        $model->update(
            $user['id'],
            ['token'=>$token]
        );