backend-api/app/Controllers/Buku.php

SELECT `buku`.*, `genre`.`nama_genre`
FROM `buku`
LEFT JOIN `genre` ON `genre`.`id` = `buku`.`genre_id`
---
    public function index()
    {
        $db = \Config\Database::connect();

        $data = $db->table('buku')
            ->select('
                buku.*,
                genre.nama_genre
            ')
            ->join(
                'genre',
                'genre.id = buku.genre_id',
                'left'
            )
            ->get()
            ->getResultArray();

SELECT `buku`.*, `genre`.`nama_genre`
FROM `buku`
JOIN `genre` ON `genre`.`id` = `buku`.`genre_id`
WHERE `buku`.`id` = '9'
 LIMIT 1
---
    public function show($id = null)
    {
        $buku = $this->model
            ->select('buku.*, genre.nama_genre')
            ->join('genre', 'genre.id = buku.genre_id')
            ->where('buku.id', $id)
            ->first();