backend-api/app/Controllers/Dashboard.php

    public function index()
    {
        $db = \Config\Database::connect();

        $data = [

            'total_buku' =>
                $db->table('buku')->countAllResults(),

            'total_anggota' =>
                $db->table('anggota')->countAllResults(),

            'total_users' =>
                $db->table('users')->countAllResults(),

            'total_peminjaman' =>
                $db->table('peminjaman')->countAllResults()
---
SELECT COUNT(*) AS `numrows`
FROM `buku`
SELECT COUNT(*) AS `numrows`
FROM `anggota`
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`