backend-api/app/Controllers/Peminjaman.php

SELECT `peminjaman`.*, `users`.`nama`, `users`.`username`, `buku`.`judul`
FROM `peminjaman`
LEFT JOIN `users` ON `users`.`id` = `peminjaman`.`user_id`
LEFT JOIN `buku` ON `buku`.`id` = `peminjaman`.`buku_id`
ORDER BY `peminjaman`.`id` DESC
---
    public function index()
    {
        $db = \Config\Database::connect();

        $data = $db->table('peminjaman')
        ->select('
            peminjaman.*,
            users.nama,
            users.username,
            buku.judul
        ')
        ->join(
            'users',
            'users.id = peminjaman.user_id',
            'left'
        )
        ->join(
            'buku',
            'buku.id = peminjaman.buku_id',
            'left'
        )
        ->orderBy('peminjaman.id','DESC')
        ->get()
        ->getResultArray();

SELECT *
FROM `buku`
WHERE `buku`.`id` = '7'
---
    public function create()
    {
        $data = $this->request->getJSON(true);

        $bukuModel = new BukuModel();

        $buku = $bukuModel->find(
            $data['buku_id']
        );

UPDATE `buku` SET `stok` = 9
WHERE `buku`.`id` IN ('7')
---
            'status' => 'Dipinjam'
        ]);

        $bukuModel->update(
            $data['buku_id'],
            [
                'stok' => $buku['stok'] - 1
            ]
        );

SELECT `peminjaman`.*, `buku`.`judul`, `buku`.`cover`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id` = `peminjaman`.`buku_id`
WHERE `peminjaman`.`user_id` = '3'
---
    public function user($id)
    {
        $db = \Config\Database::connect();

        $data = $db->table('peminjaman')
        ->select('
            peminjaman.*,
            buku.judul,
            buku.cover
        ')
        ->join(
            'buku',
            'buku.id = peminjaman.buku_id'
        )
        ->where(
            'peminjaman.user_id',
            $id
        )
        ->get()
        ->getResultArray();