backend-api/app/Filters/AuthFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $header = $request->getHeaderLine('Authorization');

        if (!$header) {
            return service('response')
                ->setJSON([
                    'message' => 'Token tidak ditemukan'
                ])
                ->setStatusCode(401);
        }

        $token = str_replace('Bearer ', '', $header);

        $model = new UserModel();

        $user = $model
            ->where('token', $token)
            ->first();
---
SELECT *
FROM `users`
WHERE `token` = '07d942052d91a7a69a8ca313aa2c163354a354a15e9d43a98b1041dba452673c'
 LIMIT 1